# 로또 프로그램
#6개 숫자 랜덤 번호 생성,6개 입력한 번호생성 , 당첨번호 확인 , 출력 
#import random

# 숫자맞추기 프로그램 
# 1차원리스트 1-25까지 숫자 생성 ,랜덤으로 섞기 ,2차원리스트에 1차원리스트값넣기 , 번호입력, 입력된 번호에 맞는 위치 x 표시 
# import random

# 성적처리 프로그램   3개만 외우기 그외는 구글검색활용
# 데이터 생성 -리스트타입의 딕셔너리 데이터 생성
# 출력화면
# 1.학생성적입력 - 학생번호 자동생성 - 학생성적입력을 무한반복실행 -이전화면이동 구현 -점수입력에 대한 체크 : 숫자인지 확인,0-100까지사이 점수인지 확인  
# 2.학생성적출력 - 상단 타이틀 출력(제목부분) - 학생별 성적출력
# 3.학생성적수정 - 수정하고자하는 학생 검색- 수정하려는 과목선택- 검색이 되지않았을경우 구현 - 
# 4.학생성적정렬 - 이름으로 순자정렬 - 합계로 순차 정렬 
# 5.학생성적검색 - 찾고자 하는 학생 검색후 있으면 화면 출력 
# 6.등수처리   -  합계를 기준으로 등수처리 진행 
# 0.종료      