# print: 출력 
# " " : 문자열 의미
# 10,20 : 숫자,""없이 사용 
print("글자를 출력")
print('글자를 출력') #둘다가능 
print('"이순신장군이 말씀했습니다."')
#특수기호 앞에 \는 그 뒤에 기호를 문자로 인식 시켜줌. 
# print("\"이순신 장군이 말씀했습니다.\"")
# ctrl +/ 주석처리 단축키 
# print 다양한 출력 방법 
# alt + 방향키 줄이동  
#print ("출력값 :",100)
#print("%s : %d" % ("출력값",100))
# % s는 문자 d는 숫자  f 실수  c는 한글자 
#print("%d %d" % (100,200))
#print("100/200=0.5")
#print(100/200)
print(10/3)
print("10/3",10/3)
#100,200, 계산을 소수점 1자리까지만 출력하시오 .
print("%d/ %d = %.3f" % (10,7,10/7))
print("%d / %d = %.1f" % (100,200,100/200))


